<a href="https://colab.research.google.com/github/Khushi-216/Python/blob/main/Prac3_Employee.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import numpy as np

In [7]:
emp=np.genfromtxt('employee.csv',delimiter=',',dtype=None,names=True,encoding=None)

In [ ]:
emp[:5]

array([(101, 'John', 'Doe', 75000, '15-05-1990', 'New York', 101, 'Engineering'),
       (102, 'Jane', 'Smith', 65000, '23-08-1988', 'San Francisco', 102, 'Marketing'),
       (103, 'Michael', 'Johnson', 80000, '10-02-1985', 'Chicago', 101, 'Engineering'),
       (104, 'Emily', 'Williams', 70000, '30-11-1992', 'Los Angeles', 103, 'Human Resources'),
       (105, 'Robert', 'Miller', 90000, '18-07-1980', 'Seattle', 102, 'Marketing')],
      dtype=[('empid', '<i8'), ('empfirstname', '<U11'), ('emplastname', '<U8'), ('sal', '<i8'), ('dateofbirth', '<U10'), ('city', '<U13'), ('deptid', '<i8'), ('deptname', '<U15')])

In [8]:
emp[emp['sal']>70000]

array([(101, 'John', 'Doe', 75000, '15-05-1990', 'New York', 101, 'Engineering'),
       (103, 'Michael', 'Johnson', 80000, '10-02-1985', 'Chicago', 101, 'Engineering'),
       (105, 'Robert', 'Miller', 90000, '18-07-1980', 'Seattle', 102, 'Marketing'),
       (106, 'Alice', 'Jackson', 72000, '05-04-1995', 'Miami', 104, 'Finance'),
       (107, 'David', 'Anderson', 85000, '12-09-1987', 'Dallas', 101, 'Engineering'),
       (108, 'Olivia', 'Thomas', 78000, '08-12-1991', 'Houston', 103, 'Human Resources'),
       (109, 'William', 'Brown', 95000, '25-06-1982', 'Phoenix', 102, 'Marketing'),
       (111, 'James', 'Clark', 89000, '22-03-1984', 'Denver', 101, 'Engineering'),
       (112, 'Emma', 'Hall', 82000, '17-01-1994', 'Portland', 103, 'Human Resources'),
       (113, 'Christopher', 'Young', 76000, '03-07-1989', 'San Diego', 102, 'Marketing'),
       (114, 'Isabella', 'Hill', 91000, '20-04-1983', 'Orlando', 101, 'Engineering'),
       (116, 'Abigail', 'Turner', 80000, '28-02-1986', 'Austin', 103, 'Human Resources'),
       (117, 'Liam', 'Carter', 74000, '05-09-1997', 'Minneapolis', 102, 'Marketing'),
       (118, 'Ella', 'Ross', 92000, '10-05-1981', 'Charlotte', 101, 'Engineering'),
       (120, 'Sofia', 'Cooper', 88000, '01-12-1988', 'Sacramento', 103, 'Human Resources')],
      dtype=[('empid', '<i8'), ('empfirstname', '<U11'), ('emplastname', '<U8'), ('sal', '<i8'), ('dateofbirth', '<U10'), ('city', '<U13'), ('deptid', '<i8'), ('deptname', '<U15')])

In [9]:
sorted=np.sort(emp,order='sal')[::-1]
sorted[:3]

array([(109, 'William', 'Brown', 95000, '25-06-1982', 'Phoenix', 102, 'Marketing'),
       (118, 'Ella', 'Ross', 92000, '10-05-1981', 'Charlotte', 101, 'Engineering'),
       (114, 'Isabella', 'Hill', 91000, '20-04-1983', 'Orlando', 101, 'Engineering')],
      dtype=[('empid', '<i8'), ('empfirstname', '<U11'), ('emplastname', '<U8'), ('sal', '<i8'), ('dateofbirth', '<U10'), ('city', '<U13'), ('deptid', '<i8'), ('deptname', '<U15')])

In [10]:
from datetime import datetime
after=np.array([datetime.strptime(d,"%d-%m-%Y").year>1990 for d in emp['dateofbirth']])
emp[after]

array([(104, 'Emily', 'Williams', 70000, '30-11-1992', 'Los Angeles', 103, 'Human Resources'),
       (106, 'Alice', 'Jackson', 72000, '05-04-1995', 'Miami', 104, 'Finance'),
       (108, 'Olivia', 'Thomas', 78000, '08-12-1991', 'Houston', 103, 'Human Resources'),
       (110, 'Sophia', 'White', 68000, '14-08-1993', 'Atlanta', 104, 'Finance'),
       (112, 'Emma', 'Hall', 82000, '17-01-1994', 'Portland', 103, 'Human Resources'),
       (115, 'Aiden', 'Ward', 69000, '15-11-1996', 'Tampa', 104, 'Finance'),
       (117, 'Liam', 'Carter', 74000, '05-09-1997', 'Minneapolis', 102, 'Marketing'),
       (119, 'Jackson', 'Martin', 67000, '18-03-1998', 'Raleigh', 104, 'Finance')],
      dtype=[('empid', '<i8'), ('empfirstname', '<U11'), ('emplastname', '<U8'), ('sal', '<i8'), ('dateofbirth', '<U10'), ('city', '<U13'), ('deptid', '<i8'), ('deptname', '<U15')])

In [11]:
dept=np.unique(emp['deptname'])
for i in dept:
  k=emp[emp['deptname']==i]
  tot_sal=np.sum(k['sal'])
  print(f"{i}     {tot_sal}")

Engineering     512000
Finance     276000
Human Resources     398000
Marketing     400000

In [12]:
current=datetime.now().year
age=np.array([current-datetime.strptime(d,"%d-%m-%Y").year for d in emp['dateofbirth']])
i=0
name_age={}
for j in emp['empfirstname']:
  name_age[j]=age[i]
  i+=1
name_age

{'John': 35,
 'Jane': 37,
 'Michael': 40,
 'Emily': 33,
 'Robert': 45,
 'Alice': 30,
 'David': 38,
 'Olivia': 34,
 'William': 43,
 'Sophia': 32,
 'James': 41,
 'Emma': 31,
 'Christopher': 36,
 'Isabella': 42,
 'Aiden': 29,
 'Abigail': 39,
 'Liam': 28,
 'Ella': 44,
 'Jackson': 27,
 'Sofia': 37}

In [13]:
avg_sal=np.mean(emp['sal'])
print(avg_sal)
city=np.unique(emp['city'])
print(city)

79300.0
['Atlanta' 'Austin' 'Charlotte' 'Chicago' 'Dallas' 'Denver' 'Houston'
 'Los Angeles' 'Miami' 'Minneapolis' 'New York' 'Orlando' 'Phoenix'
 'Portland' 'Raleigh' 'Sacramento' 'San Diego' 'San Francisco' 'Seattle'
 'Tampa']

In [17]:
increased_sal_Marketing=emp[emp['deptname']=='Marketing']
increased_sal_Marketing['sal']=increased_sal_Marketing['sal']*1.1
increased_sal_Marketing[['empfirstname','sal']]

array([('Jane',  71500), ('Robert',  99000), ('William', 104500),
       ('Christopher',  83600), ('Liam',  81400)],
      dtype={'names': ['empfirstname', 'sal'], 'formats': ['<U11', '<i8'], 'offsets': [8, 84], 'itemsize': 252})

In [18]:
top_indice=np.argsort(emp["sal"])[::-1][:3]
top_emp=emp[top_indice]
top_emp[['empfirstname','sal']]

array([('William', 95000), ('Ella', 92000), ('Isabella', 91000)],
      dtype={'names': ['empfirstname', 'sal'], 'formats': ['<U11', '<i8'], 'offsets': [8, 84], 'itemsize': 252})

UPDATE SALARY TO 80,000 FOR EMPLOYEES BEFORE 1990

In [32]:
depts= np.unique(emp['deptname'])
for i in depts:
  k=emp[emp['deptname']==i]
  mean=np.mean(k['sal'])
  median=np.median(k['sal'])
  print(f" Mean & Median of {i} are {mean} & {median}")

 Mean & Median of Engineering are 85333.33333333333 & 87000.0
 Mean & Median of Finance are 69000.0 & 68500.0
 Mean & Median of Human Resources are 79600.0 & 80000.0
 Mean & Median of Marketing are 80000.0 & 76000.0

In [34]:
unique_city=np.unique(emp['city'])
for i in unique_city:
  emp_count=len(emp[emp['city']==i])
  print(f"Number of employees in {i} is {emp_count}")

Number of employees in Atlanta is 1
Number of employees in Austin is 1
Number of employees in Charlotte is 1
Number of employees in Chicago is 1
Number of employees in Dallas is 1
Number of employees in Denver is 1
Number of employees in Houston is 1
Number of employees in Los Angeles is 1
Number of employees in Miami is 1
Number of employees in Minneapolis is 1
Number of employees in New York is 1
Number of employees in Orlando is 1
Number of employees in Phoenix is 1
Number of employees in Portland is 1
Number of employees in Raleigh is 1
Number of employees in Sacramento is 1
Number of employees in San Diego is 1
Number of employees in San Francisco is 1
Number of employees in Seattle is 1
Number of employees in Tampa is 1

In [19]:
emp[['empfirstname','emplastname','sal']]

array([('John', 'Doe', 75000), ('Jane', 'Smith', 65000),
       ('Michael', 'Johnson', 80000), ('Emily', 'Williams', 70000),
       ('Robert', 'Miller', 90000), ('Alice', 'Jackson', 72000),
       ('David', 'Anderson', 85000), ('Olivia', 'Thomas', 78000),
       ('William', 'Brown', 95000), ('Sophia', 'White', 68000),
       ('James', 'Clark', 89000), ('Emma', 'Hall', 82000),
       ('Christopher', 'Young', 76000), ('Isabella', 'Hill', 91000),
       ('Aiden', 'Ward', 69000), ('Abigail', 'Turner', 80000),
       ('Liam', 'Carter', 74000), ('Ella', 'Ross', 92000),
       ('Jackson', 'Martin', 67000), ('Sofia', 'Cooper', 88000)],
      dtype={'names': ['empfirstname', 'emplastname', 'sal'], 'formats': ['<U11', '<U8', '<i8'], 'offsets': [8, 52, 84], 'itemsize': 252})

In [54]:

sal_count=emp[(emp['sal']>60000) & (emp['sal']<80000)]
print(len(sal_count))
#eldest individual in the office
current=datetime.now().year
age=np.array([current-datetime.strptime(d,"%d-%m-%Y").year for d in emp['dateofbirth']])
i=0
name_age={}
for j in emp['empfirstname']:
  name_age[j]=age[i]
  i+=1
max_age=max(name_age,key=name_age.get)
print(max_age,"is the eldest employee of age:",np.max(age))

10
Robert is the eldest employee of age: 45